# taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/services'

# binaries
brew 'coreutils' # those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gnupg'
brew 'yubikey-personalization' # yubikey
brew 'hopenpgp-tools' # yubikey
brew 'ykman' # yubikey
brew 'pinentry-mac' # yubikey
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # mac app store manager
brew 'pkg-config'

# spatie medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# development
brew 'starship'
brew 'go'
brew 'rust'
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql', restart_service: true
brew 'nginx'
brew 'node'
brew 'watchman'
brew 'cocoapods'
brew 'redis', restart_service: true
brew 'gh'
brew 'wget'

# apps
cask 'discord'
cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'
cask 'github'
cask 'gpg-suite'
cask 'imageoptim'
cask 'postman'
cask 'ray'
cask 'screenflow'
cask 'tableplus'
cask 'telegram-desktop'
cask 'tinkerwell'
cask 'invoker'
cask 'helo'
cask 'visual-studio-code'
cask 'zoom'
cask 'dropbox'
cask 'android-studio'
cask 'grammarly'
cask 'obsidian'
cask 'fork'
cask 'blender'

# mac app store
mas 'Giphy Capture', id: 668208984
mas 'Bear', id: 1091189122
mas 'Save to Pocket', id: 1477385213
