# taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/services'

# binaries
brew 'coreutils' # those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gnupg'
brew 'yubikey-personalization' # yubikey
brew 'hopenpgp-tools' # yubikey
brew 'ykman' # yubikey
brew 'pinentry-mac' # yubikey
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'pkg-config'

# development
brew 'go'
brew 'rust'
brew 'mysql', restart_service: true
brew 'herd'

# apps
cask 'gpg-suite'
cask 'imageoptim'
cask 'postman'
cask 'tableplus'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'android-studio'
cask 'obsidian'
cask 'arc'
