# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/services'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gh'
brew 'gnupg'
brew 'yubikey-personalization' # Yubikey
brew 'hopenpgp-tools' # Yubikey
brew 'ykman' # Yubikey
brew 'pinentry-mac' # Yubikey
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql', restart_service: true
brew 'nginx'
brew 'node'
brew 'watchman' # React Native
brew 'cocoapods' # iOS App Development
brew 'redis', restart_service: true
brew 'rust'
brew 'hyper'

# Apps
cask 'discord'
cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'
cask 'github'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'ray'
cask 'screenflow'
cask 'tableplus'
cask 'telegram-desktop'
cask 'tinkerwell'
cask 'invoker'
cask 'helo'
cask 'visual-studio-code'
cask 'zoom'
cask 'dropbox'
cask 'bitwarden'
cask 'android-studio'
cask 'grammarly'
cask 'obsidian'
cask 'anydesk'
cask 'keybase'
cask 'figma'
cask 'notion'
cask 'slack'
cask 'react-native-debugger'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Bear', id: 1091189122
mas 'Save to Pocket', id: 1477385213
